{
  "basics": {
    "name": "Michael Van Der Velden",
    "website": "https://mikevdv.me",
    "twitter": "https://twitter.com/mvd_vandie",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Liverpool",
      "countryCode": "UK",
      "region": "Merseyside"
    },
    "email": "mikevdv@vandie.co.uk",
    "phone": "contact me for my phone number",
    "description": "My name is Michael. I am a full stack javascript developer based in Liverpool. At age 16, I founded a limited company to sell a web based reward system to businesses. I worked on this product with 2 others and while it is no longer running, it helped me to gain an appreciation for various aspects of the software development and sales cycle. At the beginning of 2018, I joined Mashbo, where I currently work on client based web apps and websites. I have worked on numerous open source projects which can be found on my linked Github and Twitter accounts. I am a strong member of any team and am always happy and open to new ideas and approaches."
  },
  "education": [
    {
      "area": "Computer Science",
      "gpa": "C",
      "institution": "The Studio School",
      "studyType": "A Level",
      "location": "Liverpool",
      "startDate": "Sep 2014",
      "endDate": "Jul 2017"
    },
    {
      "area": "Creative Media",
      "gpa": "D* D*",
      "institution": "The Studio School",
      "studyType": "BTEC",
      "location": "Liverpool",
      "startDate": "Sep 2014",
      "endDate": "Jul 2017"
    }
  ],
  "work": [
    {
      "company": "Vandie Studios Ltd.",
      "position": "Founder",
      "website": "http://vandie.co.uk",
      "endDate": "Jan 2018",
      "highlights": [
        "Design and Build our gratitude based reward system using a range of technologies",
        "Ensure the site was presentable and pitch it to potential investors",
        "Ensure that the companies finances kept us afloat",
        "Pitch the product to potential buyers",
        "Manage the development team"
      ],
      "location": "Liverpool",
      "startDate": "Aug 2015"
    },
    {
      "company": "Angel Solutions.",
      "position": "Intern / Under Mentorship",
      "website": "http://www.angelsolutions.co.uk",
      "endDate": "Feb 2018",
      "highlights": [
        "Took part in regular \"Clean Code\" Sessions",
        "Had regular meetings with owner, Andy Kent, about my own company",
        "Discussed Programing best practice with team members"
      ],
      "location": "Liverpool",
      "startDate": "June 2016"
    },
    {
      "highlights": [
        "Build stateful web applications using Ember.JS",
        "Work with clients to ensure Wordpress blogs met their design brief",
        "Manage deadlines to ensure that client projects got out the door by given release dates",
        "Research new technologies that could make products better for clients"
      ],
      "company": "Mashbo",
      "position": "Front End Developer",
      "location": "Liverpool",
      "startDate": "March 2018",
      "endDate": "Present"
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "",
      "keywords": [
        "JavaScript (Including ES2015+ and Node.JS)",
        "Vue.JS",
        "Ember.JS",
        "React (Basic ability)",
        "CSS",
        "SCSS",
        "HTML",
        "PHP",
        "SQL",
        "MongoDB"
      ]
    },
    {
      "name": "Software & Game Development",
      "level": "",
      "keywords": [
        "C#",
        "Unity 3D",
        "Electron"
      ]
    },
    {
      "name": "Proficient Tools",
      "level": "",
      "keywords": [
        "Git",
        "Github",
        "Gitlab",
        "VS Code",
        "Insomnia",
        "Visual Studio",
        "Trello",
        "JIRA"
      ]
    },
    {
      "keywords": [
        "I'm confident",
        "I'm at ease speaking in front of large and small crowds alike",
        "I can easily listen to a range of solutions and decide on a plan of approach",
        "I can take criticism in my stride and use it to better myself",
        "I can work in a team or alone depending on what the situation requires"
      ],
      "name": "Soft Skills"
    },
    {
      "keywords": [
        "English",
        "Dutch"
      ],
      "name": "Languages"
    }
  ],
  "projects": [
    {
      "name": "Thanks",
      "description": "Although the project is no longer up and running, Thanks was a gratitude based reward system for employees and students wherein helping your coworkers could be internally recognised and later rewarded. It was the primary product of my company, Vandie Studios Ltd.",
      "url": "",
      "keywords": [
        "NodeJS",
        "MongoDB",
        "Micro-services",
        "Java",
        "Swift",
        "AWS"
      ]
    },
    {
      "keywords": [
        "Wordpress",
        "Sage 9",
        "JS (ES6)",
        "Webpack",
        "SCSS"
      ],
      "name": "Centre for Alternative Technology",
      "description": "While working at Mashbo, a client wanted a Wordpress website that combined there many sites into one. After a long set of planning, I realised that the we could offer them increased flexibility despite the limitation of the Wordpress platform by building a modular \"blocks\" system for their website. After working with the in-house designer to split his design into \"blocks, My coworkers agreed and I looked at building a prototype for the system. A little after the site was signed off by the client, Wordpress Gutenberg was released with many of the same ideas that we had put into the CAT website.",
      "url": "https://www.cat.org.uk/"
    },
    {
      "keywords": [
        "Ember.JS",
        "Webpack",
        "PHP",
        "SCSS"
      ],
      "name": "Property Cloud",
      "description": "One of Mashbo's biggest products, Property cloud is an online student accommodation management tool. Allowing students to get paperwork filled quickly, report issues easily all the while decreasing the amount of work required by agents. I worked on property cloud sporadically, when required, and helped restructure the routing system for the project as well as making the login flow simpler and more fluid. One of the first tasks I had on the project was to build the current (accurate as of 20th of Feb 2019) landing page.",
      "url": "https://www.propertycloud.io"
    }
  ],
  "awards": [
    {
      "summary": "After pitching against a range of other local ideas, We were selected for a grant of £500 in order to kickstart the building of our Thanks platform",
      "title": "Awesome Liverpool",
      "date": "Feb 2017",
      "awarder": "The Awesome Foundation"
    }
  ]
}
