{
	"basics": {
		"name": "Michael Van Der Velden",
		"website": "https://mikevdv.me",
		"twitter": "https://twitter.com/mvd_vandie",
		"location": {
			"address": "",
			"postalCode": "",
			"city": "Liverpool",
			"countryCode": "UK",
			"region": "Merseyside"
		},
		"email": "mikevdv@vandie.co.uk",
		"phone": "removed",
		"description": "My name is Michael. I am a full stack javascript developer based in Liverpool. At age 16, I founded a limited company to sell a web based reward system to businesses. While that product is no longer accessible to the public, I used it as a jumping off platform to get my foot into the development world. After some time at an internship and a stint at a web development agency, I got a job at Puntt. I have been working at Puntt since partway through 2019 and have been responsible for updating and maintaining the core systems for day to day business. I'm a confident individual, who likes to keep my skills on the cutting edge, and a potential asset to any team."
	},
	"education": [{
			"area": "Computer Science",
			"gpa": "C",
			"institution": "The Studio School",
			"studyType": "A Level",
			"location": "Liverpool",
			"startDate": "Sep 2014",
			"endDate": "Jul 2017"
		},
		{
			"area": "Creative Media",
			"gpa": "D* D*",
			"institution": "The Studio School",
			"studyType": "BTEC",
			"location": "Liverpool",
			"startDate": "Sep 2014",
			"endDate": "Jul 2017"
		}
	],
	"work": [{
			"company": "RPGG Media Ltd",
			"highlights": [
				"Maintain the core systems of the Puntt product",
				"Train up new staff members on the processes and standards followed within the Puntt codebase",
				"Support the operations staff when issues were faced outside of standard hours",
        "Build internal tooling that allows operations staff to interact with our core systems"
			],
			"website": "https://puntt.gg/",
			"startDate": "Jul 2019",
			"endDate": "Present",
			"location": "Liverpool",
			"position": "Software Engineer"
		},
		{
			"company": "Angel Solutions.",
			"position": "Internship",
			"website": "http://www.angelsolutions.co.uk",
			"endDate": "Feb 2018",
			"highlights": [
				"Took part in regular \"Clean Code\" Sessions",
				"Discussed Programming best practice with team members",
				"Regularly met with the company founder to access skill progress"
			],
			"location": "Liverpool",
			"startDate": "June 2016"
		},
		{
			"highlights": [
				"Build stateful web applications using Ember.JS",
				"Work with clients to ensure Wordpress blogs met their design brief",
				"Manage deadlines to ensure that client projects got out the door by given release dates",
				"Research new technologies to ensure products were improved for clients were possible"
			],
			"company": "Mashbo",
			"position": "Front End Developer",
			"location": "Liverpool",
			"startDate": "Mar 2018",
			"endDate": "Jun 2019"
		}
	],
  "skills": [
    {
      "name": "Javascript Development",
      "level": "",
      "keywords": [
        "Javascript ES6+ - I use modern Javascript extensively, having converted multiple projects from JQuery to modern JS and having maintained a number of pure JS projects.",
        "NodeJS - At every role I've had I used NodeJS as my go to backend language of choice. While occasionally used alongside PHP, I have usually used this with Express and NginX for the best experience. At RPGG, the majority of the core betting code is NodeJS Code I've written.",
        "Vue.JS 2 - Used for numerous internal projects while at RPGG Media Ltd and Mashbo as well as most of my personal projects. Some highlights include Thanks and my CV site.",
        "Svelte - Used for most of the newer projects a RPGG Media Ltd. The Puntt client rebuild is using this meaning I've gotten very confident with it.",
        "Ember.JS - Used extensively at Mashbo for web app projects. Including a few VR ones.",
        "React - I used react when building the mashbo component based site builder. A way I developed for clients to be able to edit parts of their sites themselves."
      ]
    },
    {
      "name": "Testing Frameworks",
      "level": "",
      "keywords": [
        "Tape - The standard testing framework at RPGG Media Ltd. Easy to use and lightweight. I've pushed to increase our test suite from 20% to 80% using this framework.",
        "Mocha - Used for older personal projects as it's fairly well documented.",
        "Sinon - The main mocking library used at RPGG Media Ltd. Has a few gotchas in how it works but these can be avoided using good coding practices.",
        "Proxyquire - The other testing framework I use daily when writing tests on my code at RPGG. Useful in cases where sinon won't quite do what you need",
        "QUnit & QUnit DOM - Used for ember projects at Mashbo and was the first testing framework I had to use frequently."
      ]
    },
    {
      "name": "Databases (NoSQL and SQL)",
      "level": "",
      "keywords": [
        "MongoDB - For personal projects, mongoDB is my goto. It's easy to set up, simple to secure and nice to work with. For a lot of smaller projects where you want to iterate quickly, mongoDB is perfect.",
        "Couchbase - Puntt is built on top of couchbase, using extensive use of couchbase views for fast information recall. As such, I have a good understanding of couchbase and how to use it effectively.",
        "SQL - At Mashbo, due to the heavy use of PHP on some projects, SQL was used due to its good support in both NodeJS and PHP. As such I'm comfortable using SQL day to day."
      ]
    },
    {
      "name": "Other Web Development Skills",
      "level": "",
      "keywords":[
        "CSS - I'm very comfortable with css. having spent time as a front end developer it was for a while my bread and butter.",
        "SCSS - I find SCSS can sometimes be quicker to write but it has its downsides in encouraging bad practices which I've learned to avoid.",
        "HTML - Basic skill I've used for every bit of web dev I've ever done.",
        "PHP - Mashbo used a fair bit of PHP using a variety of frameworks, as such, while it wasn't my main tool. It was something I got comfortable with."
      ]
    },
    {
      "name": "Software Development",
      "level": "",
      "keywords": [
        "Electron - Most offline tools I build for RPGG are built in electron due to its portability and ease of use.",
        "Rust - During the lockdown of 2020 I took the time out to learn rust. While not at the level of most of my skills, I'm still very comfortable with it.",
        "Haxe - A great cross platform language. While not used in many professional settings, writing Haxe is a personal hobby of mine."
      ]
    },
    {
      "name": "Proficient Tools",
      "level": "",
      "keywords": [
        "Git",
        "Github",
        "Gitlab",
        "VS Code",
        "Insomnia",
        "Visual Studio",
        "Trello",
        "JIRA"
      ]
    },
    {
      "keywords": [
        "I'm confident",
        "I'm at ease speaking in front of large and small crowds alike",
        "I can easily listen to a range of solutions and decide on a plan of approach",
        "I can take criticism in my stride and use it to better myself",
        "I can work in a team or alone depending on what the situation requires",
        "I'm a very fast learner as I'm able to get myself up to speed and start being productive with little guidence."
      ],
      "name": "Soft Skills"
    },
    {
      "keywords": [
        "English",
        "Dutch"
      ],
      "name": "Languages"
    }
  ],
	"projects": [{
			"name": "Puntt",
			"url": "https: //puntt.gg",
			"keywords": [
				"NodeJS",
				"Couchbase",
				"PHP",
				"Svelte",
        "Google Cloud",
        "Docker"
			],
			"description": "Puntt is the world's first licenced esports player betting site. Making use of proprietary pool betting systems, I am responsible for maintaining the core backend of the Puntt Site. This includes the systems for running the betting pools as well as the systems for settlement based on external APIs. I have trained up multiple new staff members to ensure they can help maintain these systems and have built the needed tooling for operations staff to perform their roles."
		},
		{
			"name": "Thanks",
			"description": "Although the project is no longer up and running, Thanks was a gratitude based reward system for employees and students wherein helping your coworkers could be internally recognised and later rewarded. It was the primary product of my company, Vandie Studios Ltd.",
			"url": "",
			"keywords": [
				"VueJS",
				"NodeJS",
				"MongoDB",
				"Google Cloud"
			]
		}
	],
	"awards": [{
		"summary": "After pitching against a range of other local ideas, We were selected for a grant of £500 in order to kickstart the building of our Thanks platform",
		"title": "Awesome Liverpool",
		"date": "Feb 2017",
		"awarder": "The Awesome Foundation"
	}]
}
